{
  "id": "ProviderNameApplianceName",
  "title": "F-Secure Data Connector",
  "publisher": "F-Secure",
  "descriptionMarkdown": "Common Event Format (CEF) is an industry standard format on top of Syslog messages, used by many security vendors to allow event interoperability among different platforms. By connecting your CEF logs to Azure Sentinel, you can take advantage of search & correlation, alerting, and threat intelligence enrichment for each log.",
  "graphQueries": [
    {
      "metricName": "Total data received",
      "legend": "DATATYPE_NAME",
      "baseQuery": "CommonSecurityLog\n| where DeviceVendor == \"PROVIDER NAME\"\n| where DeviceProduct == \"APPLIANCE NAME\""
    }
  ],
  "sampleQueries": [
    {
      "description" : "Events count by source username",
      "query": "CommonSecurityLog\n| summarize count() by SourceUserName\n| render piechart"
    }
  ],
  "dataTypes": [
    {
      "name": "CommonSecurityLog (F-Secure Elements)",
      "lastDataReceivedQuery": "CommonSecurityLog\n| where DeviceVendor == \"PROVIDER NAME\"\n| where DeviceProduct == \"APPLIANCE NAME\"\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
    }
  ],
  "connectivityCriterias": [
    {
      "type": "IsConnectedQuery",
      "value": [
        "CommonSecurityLog\n| where DeviceVendor == \"PROVIDER NAME\"\n| where DeviceProduct == \"APPLIANCE NAME\"\n| summarize LastLogReceived = max(TimeGenerated)\n| project IsConnected = LastLogReceived > ago(30d)"
      ]
    }
  ],
  "availability": {
    "status": 1,
    "isPreview": true
  },
  "permissions": {
    "resourceProvider": [
      {
        "provider": "Microsoft.OperationalInsights/workspaces",
        "permissionsDisplayText": "read and write permissions are required.",
        "providerDisplayName": "Workspace",
        "scope": "Workspace",
        "requiredPermissions": {
          "read": true,
          "write": true,
          "delete": true
        }
      },
      {
        "provider": "Microsoft.OperationalInsights/workspaces/sharedKeys",
        "permissionsDisplayText": "read permissions to shared keys for the workspace are required. [See the documentation to learn more about workspace keys](https://docs.microsoft.com/azure/azure-monitor/platform/agent-windows#obtain-workspace-id-and-key).",
        "providerDisplayName": "Keys",
        "scope": "Workspace",
        "requiredPermissions": {
          "action": true
        }
      }
    ]
  },
  "instructionSteps": [
    {
      "title": "1. Linux Syslog agent configuration",
      "description": "Install and configure the Linux agent to collect your Common Event Format (CEF) Syslog messages and forward them to Azure Sentinel.\n\n> Notice that the data from all regions will be stored in the selected workspace",
      "innerSteps": [
        {
          "title": "1.1 Select or create a Linux machine",
          "description": "Select or create a Linux machine that Azure Sentinel will use as the proxy between your security solution and Azure Sentinel this machine can be on your on-prem environment, Azure or other clouds."
        },
        {
          "title": "1.2 Install the CEF collector on the Linux machine",
          "description": "Install the Microsoft Monitoring Agent on your Linux machine and configure the machine to listen on the necessary port and forward messages to your Azure Sentinel workspace. The CEF collector collects CEF messages on port 514 TCP.\n\n> 1. Make sure that you have Python on your machine using the following command: python -version.\n\n> 2. You must have elevated permissions (sudo) on your machine.",
          "instructions": [
            {
              "parameters": {
                "fillWith": [
                  "WorkspaceId",
                  "PrimaryKey"
                ],
                "label": "Run the following command to install and apply the CEF collector:",
                "value": "sudo wget -O cef_installer.py https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/DataConnectors/CEF/cef_installer.py&&sudo python cef_installer.py {0} {1}"
              },
              "type": "CopyableLabel"
            }
          ]
        }
      ]
    },
    {
      "title": "2. Install Elements Connector for Linux and follow admin guide instruction to enable event forwarding",
      "description": "https://help.f-secure.com/product.html#business/connector/latest/en/concept_3BE93669AFF245E8B726A57A60CB451E-latest-en"
    }
  ],
  "metadata": {
    "id": "Unique Identifier (GUID) used to identify dependencies and content from solutions or community.",
    "version": "1.0.0",
    "kind": "dataConnector",
    "source": {
      "kind": "solution",
      "name": "F-Secure Elements"
    },
    "author": {
      "name": "rd-team-yoda@f-secure.com"
    },
    "support": {
      "tier": "developer",
      "name": "F-Secure Elements",
      "email": "rd-team-yoda@f-secure.com",
      "link":"Optional: Link for support help, like to support page to open a ticket etc"
    }
  }
}
